In [1]:
import pandas as pd

In [4]:
df= pd.read_parquet('data/employees.parquet')

In [5]:
df.head()

   id             name  gender         doj  salaries      positions
0  51  Valerie Herrera  Female  2019-07-05    178942  HR Specialist

In [4]:
df.rename(columns = {'Date of Joining':'doj'},inplace=True)

In [5]:
# max salary of manager
df[df['Position'] == 'Manager']['Salary'].max()

np.int64(249999)

In [6]:
# get max salaries of all positions in the dataset
df[['Position','Salary']].groupby('Position')['Salary'].max()

Position
Analyst              249998
Designer             249999
HR Specialist        249999
Manager              249999
Software Engineer    249999
Name: Salary, dtype: int64

In [7]:
df.groupby('Position').agg({'Salary':'max'})

                   Salary
Position
Analyst            249998
Designer           249999
HR Specialist      249999
Manager            249999
Software Engineer  249999

In [8]:
# get the gender ratio of the dataset
df['Gender'].value_counts()

Gender
Male      500007
Female    499993
Name: count, dtype: int64

In [9]:
# get ratio of positions
df['Position'].value_counts()

Position
Software Engineer    200502
Manager              200188
Designer             200129
Analyst              200120
HR Specialist        199061
Name: count, dtype: int64

In [16]:
df['doj'] = pd.to_datetime(df['doj'])

In [11]:
# in which year were there maximum joinees
df['year'] = pd.to_datetime(df['doj'],format = '%Y-%m-%d',errors='coerce').dt.year

In [12]:
df.head()

   Employee ID   Name  Gender         doj  Salary           Position  year
0            1    Sam    Male  2024-03-27  162240  Software Engineer  2024
1            2    Raj  Female  2020-05-13  208610      HR Specialist  2020
2            3  Shyam    Male  2023-02-12  223557            Analyst  2023
3            4    Sam    Male  2020-12-14  114925            Manager  2020
4            5    Sam    Male  2022-01-28  227934      HR Specialist  2022

In [13]:
df.groupby('year').agg({'doj':'count'}).sort_values(ascending = False,by = 'doj').reset_index()
# in year 2021 had max no of joinees

    year     doj
0   2015  102093
1   2019  102060
2   2020  101950
3   2023  101901
4   2018  101751
5   2017  101634
6   2021  101424
7   2022  101311
8   2016  101201
9   2024   75039
10  2014    9636

In [ ]:
# in which month of year 2021 did max joinees occur
# give 20% raise to all Managers, 15% raise to all Hr specilists, 25% raise to software engineers
# year in which max female joinees occured
# year in which max male employees occured
# create a new column years in service

In [17]:
df_2021=df[df['doj'].dt.year == 2021]

In [19]:
df_2021['year_month'] = df_2021['doj'].dt.to_period('M')

/tmp/ipykernel_78537/3856632438.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_2021['year_month'] = df_2021['doj'].dt.to_period('M')

In [20]:
df_2021.head()

,Employee ID,Name,Gender,doj,Salary,Position,year,year_month
5,6,Sam,Female,2021-11-10,60690,Manager,2021,2021-11
9,10,Raj,Male,2021-01-01,187606,Software Engineer,2021,2021-01
29,30,Harshal,Male,2021-12-09,205703,Software Engineer,2021,2021-12
46,47,Sam,Male,2021-04-16,167143,Designer,2021,2021-04
50,51,Shyam,Female,2021-12-14,125667,Analyst,2021,2021-12

In [21]:
joiners_per_month = df_2021['year_month'].value_counts().sort_index()

In [26]:
max_joiners_month = joiners_per_month.idxmax()
max_joiners_count = joiners_per_month.max()
max_joiners_month_name = max_joiners_month.strftime('%B')

In [27]:
print(f"The month with the maximum joiners in 2021 is {max_joiners_month_name} with {max_joiners_count} joiners.")

The month with the maximum joiners in 2021 is August with 8702 joiners.

In [28]:
df.loc[df['Position'] == 'Manager', 'Salary'] *= 1.20

df.loc[df['Position'] == 'HR Specialist', 'Salary'] *= 1.15

df.loc[df['Position'] == 'Software Engineer', 'Salary'] *= 1.25
df.head()

/tmp/ipykernel_78537/748732621.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[137910.   72828.  206184.  ...  78766.8 152712.   52930.8]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[df['Position'] == 'Manager', 'Salary'] *= 1.20

   Employee ID   Name  Gender        doj    Salary           Position  year
0            1    Sam    Male 2024-03-27  202800.0  Software Engineer  2024
1            2    Raj  Female 2020-05-13  239901.5      HR Specialist  2020
2            3  Shyam    Male 2023-02-12  223557.0            Analyst  2023
3            4    Sam    Male 2020-12-14  137910.0            Manager  2020
4            5    Sam    Male 2022-01-28  262124.1      HR Specialist  2022

In [34]:
df_females = df[df['Gender'] == 'Female']
df_males = df[df['Gender'] == 'Male']

df_males['year'] = df_males['doj'].dt.year

df_females['year'] = df_females['doj'].dt.year

female_joiners_per_year = df_females['year'].value_counts().sort_index()
male_joiners_per_year = df_males['year'].value_counts().sort_index()

max_female_joiners_year = female_joiners_per_year.idxmax()
max_female_joiners_count = female_joiners_per_year.max()
max_male_joiners_year = male_joiners_per_year.idxmax()
max_male_joiners_count = male_joiners_per_year.max()
print(f"The year with the maximum female joiners is {max_female_joiners_year} with {max_female_joiners_count} joiners.")
print(f"The year with the maximum male joiners is {max_male_joiners_year} with {max_male_joiners_count} joiners.")

The year with the maximum female joiners is 2023 with 51150 joiners.
The year with the maximum male joiners is 2015 with 51072 joiners.

/tmp/ipykernel_78537/1578466462.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_males['year'] = df_males['doj'].dt.year
/tmp/ipykernel_78537/1578466462.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_females['year'] = df_females['doj'].dt.year

In [39]:
current_date = pd.to_datetime('today')

df['Years in Service'] = (current_date - df['doj']).dt.days / 365.25

# Optionally, you can round the years to a certain number of decimal places, e.g., 2 decimals:
df['Years in Service'] = df['Years in Service'].round(2)
df.head()

,Employee ID,Name,Gender,doj,Salary,Position,year,Years in Service
0,1,Sam,Male,2024-03-27,202800.0,Software Engineer,2024,0.68
1,2,Raj,Female,2020-05-13,239901.5,HR Specialist,2020,4.55
2,3,Shyam,Male,2023-02-12,223557.0,Analyst,2023,1.80
3,4,Sam,Male,2020-12-14,137910.0,Manager,2020,3.96
4,5,Sam,Male,2022-01-28,262124.1,HR Specialist,2022,2.84